Revit 2026 API

# ElectricalSettingCircuitRating Property

---

The default circuit rating for newly created circuit.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double CircuitRating { get; set; }
```
```vb
Public Property CircuitRating As Double
	Get
	Set
```
```cpp
public:
property double CircuitRating {
	double get ();
	void set (double value);
}
```
```fsharp
member CircuitRating : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The circuit rating should be non-negative. |

#### Reference

ElectricalSetting Class

Autodesk.Revit.DB.Electrical Namespace